test.xml

<?xml version="1.0" encoding="utf-8"?><SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"><SOAP:Body><msg:Envelope xmlns:msg="urn:cz:mfcr:iissp:schemas:Messaging:v1" xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1"><msg:EnvelopeHeader><cmn:TransactionId>d619fe7ed2b5417bbab9aeed3020e694</cmn:TransactionId><msg:DateTimeCreated>2011-06-15T03:09:57Z</msg:DateTimeCreated><msg:Sender><cmn:IC /><cmn:SubjectName /><cmn:ResponsiblePerson><cmn:PersonName /><cmn:Email /><cmn:PersonId /></cmn:ResponsiblePerson></msg:Sender><msg:Recipient><cmn:IC /><cmn:SubjectName /><cmn:Module /></msg:Recipient></msg:EnvelopeHeader><msg:EnvelopeBody><msg:Inbox xmlns:msg="urn:cz:mfcr:iissp:schemas:Messaging:v1"><msg:SeznamZpravPozadavek><msg:ZobrazitHromadneZpravy>0</msg:ZobrazitHromadneZpravy><msg:ZpravaStatus></msg:ZpravaStatus><msg:TypDatoveZpravy></msg:TypDatoveZpravy><msg:ZpravaDatumVytvoreniOd></msg:ZpravaDatumVytvoreniOd><msg:ZpravaDatumVytvoreniDo></msg:ZpravaDatumVytvoreniDo></msg:SeznamZpravPozadavek></msg:Inbox></msg:EnvelopeBody></msg:Envelope></SOAP:Body></SOAP:Envelope>